[
  {
    "start": "2024-08-24T16:00:12+00:00",
    "end": "2024-08-25T01:00:12+00:00",
    "id": "evt-ZUDkXa7QGdlB0kZ@events.lu.ma",
    "summary": "Open Source AI Hackathon #8",
    "description": "Get up-to-date information at: https://lu.ma/gksfk7q2\n\nAddress:\nMicrosoft Reactor Redmond\n\nCome ready to learn how to build on LLMs and work with a team to build an AI Application! We'll start with a hands-on tutorial, so come ready to code! Bring your laptop!\nYou will need to have:\nA recent version of Python (I use 3.11)\nA vague idea of what an LLM is\nAn enjoyment of building things with code\nYou will get:\nA hands-on, practical training to learn how to build AI\nPizza, the classic lunch fuel for hackathons\nA snack in the afternoon that may or may not be bubble tea\nYou will have roughly 6 hours to make:\nA public GitHub repo containing your project code\nA presentation that you will…\n\nHosted by Yujian Tang",
    "location": "Microsoft Reactor Redmond, 3709 157th Ave NE, Redmond, WA 98052, USA",
    "url": "https://lu.ma/gksfk7q2"
  },
  {
    "start": "2024-08-24T20:00:00+00:00",
    "end": "2024-08-24T21:00:00+00:00",
    "id": "evt-25QiP9LeEsAYItV@events.lu.ma",
    "summary": "Crunch & Brunch x Inspire Seattle",
    "description": "Get up-to-date information at: https://lu.ma/l8hsb3ai\n\nAddress:\nInspire Seattle\n\nOn Saturday August 24th, Join us for a lagree class at Inspire Seattle's Queen Anne Studio. After class, we'll head over to Citizen Collective for brunch.\nBring a water bottle and grip socks for the class!\nThank you to Lemon Perfect (@lemonperfect) and Fair & Square (@itsfairandsquare) who will also be providing refreshing post-workout drinks and snacks for everyone.\nPlease arrive 15 minutes before class starts!\n1:00pm: arrive at Inspire Seattle - Queen Anne. Check in, and get excited for class.\n1:15pm: Class starts! This is a 40-minute class.\n2:00pm: Head over to Citizen Collective for…\n\nHosted by Miracle Olatunji",
    "location": "Inspire Seattle, 2215 Queen Anne Ave N #2313, Seattle, WA 98109, USA",
    "url": "https://lu.ma/l8hsb3ai"
  },
  {
    "start": "2024-08-28T00:00:00+00:00",
    "end": "2024-08-28T01:30:00+00:00",
    "id": "evt-Eq8na9Ey8MlpIkZ@events.lu.ma",
    "summary": "Good Vibes Social Club Presents:  Social #2",
    "description": "Get up-to-date information at: https://lu.ma/24ccoqv7\n\nAddress:\nCheck event page for more details.\n\n🎉Join us during for a casual social event in a beautiful venue in South Lake Union.\nThis event will feature facilitated networking and is for entrepreneurs, tech professionals, investors,  operators and friends.\n\nHosted by Christine Alluise",
    "location": "https://lu.ma/e/evt-Eq8na9Ey8MlpIkZ",
    "url": "https://lu.ma/24ccoqv7"
  },
  {
    "start": "2024-08-28T23:30:00+00:00",
    "end": "2024-08-29T01:30:00+00:00",
    "id": "evt-czyTLYkARXSSVQx@events.lu.ma",
    "summary": "Seattle Meetup with Health Tech Nerds",
    "description": "Get up-to-date information at: https://lu.ma/sn0ehvbm\n\nAddress:\nCitizen Collective\n\nA casual happy hour for folks working or interested in healthcare/health tech to hang out and get to know one another! Anyone is welcome to attend.\n---\nSupported by Health Tech Nerds, a global community of 5,500+ healthcare professionals connecting to learn, network, build, and grow. It's the most supportive network in healthcare, where exchanging knowledge and experiences, joint-problem solving, and meaningful connections lead to impactful outcomes.\n\nHosted by Health Tech Nerds",
    "location": "Citizen Collective, 706 Taylor Ave N, Seattle, WA 98109, USA",
    "url": "https://lu.ma/sn0ehvbm"
  },
  {
    "start": "2024-08-29T00:30:00+00:00",
    "end": "2024-08-29T02:30:00+00:00",
    "id": "evt-OyqB8NRNRgIuNZ3@events.lu.ma",
    "summary": "Community Picnic for WAC Seattle's First Birthday",
    "description": "Get up-to-date information at: https://lu.ma/0budrdia\n\nAddress:\nGreen Lake Park\n\nWAC Seattle launched in July 2023 and our community has grown so much already! Join us to celebrate our first  birthday and a successful year of community building in support of Women and Climate Action within the Seattle area!\nWhat to Expect:\nCasual gathering of Women and Nonbinary folks passionate about climate change with a  collection of snacks/beverages (potluck style). Most of the event will be unstructured for informal conversation and outdoor activities.\nA specific location within the park will be shared in the days leading up to the event so that you know where to find us!\nWhat to…\n\nHosted by Jaxie Friedman & 3 others",
    "location": "Green Lake Park, 7201 East Green Lake Dr N, Seattle, WA 98115, USA",
    "url": "https://lu.ma/0budrdia"
  },
  {
    "start": "2024-08-29T01:00:00+00:00",
    "end": "2024-08-29T05:00:00+00:00",
    "id": "evt-L7m6e20axdW55FB@events.lu.ma",
    "summary": "Seattle: Epic Launch Party (Design Buddies & UXGO)",
    "description": "Get up-to-date information at: https://lu.ma/seattle-party\n\nAddress:\nCheck event page for more details.\n\nWe're launching something epic in community + education with Design Buddies and UXGO! Come join our epic launch party in Seattle and hang out with other creatives!\nHosted by co-founders Leon Zhang and Grace Ling! This is also taking place on Grace's birthday 👀\n\n🐰 About Design Buddies\nDesign Buddies is a community where you level up your design career. Land jobs, improve your design skills, and make friends. We have resources, events, design challenges, job boards, fun perks, and more. Founded by Grace Ling\n👋 Visit our website, hop into our community, and subscribe to our newsletter!\n💖…\n\nHosted by Design Buddies, Grace Ling & Leon Zhang",
    "location": "https://lu.ma/e/evt-L7m6e20axdW55FB",
    "url": "https://lu.ma/seattle-party"
  },
  {
    "start": "2024-08-29T03:00:00+00:00",
    "end": "2024-08-29T04:30:00+00:00",
    "id": "evt-olBgZQIpoOACyzy@events.lu.ma",
    "summary": "Crowdsource Choir - \"Sing it Home\" In the Turbine Cathedral",
    "description": "Get up-to-date information at: https://lu.ma/rjnmb93j\n\nAddress:\nGeorgetown Steam Plant\n\nCrowdsource Choir and Infinite Spaces present:\nCrowdsource Choir - (To Be Announced) in the Turbine Cathedral\nJoin us as we close out the summer season for a harmonious evening at the historic Georgetown Steam Plant featuring an uplifting and vocally-friendly song \"Home\" by Phillip Phillips. It's the perfect, harmonious note to end our summer on.\nStep inside the giant machine crafted in the early 1900s where the incredible acoustics enhance every voice, making this harmonious singing experience truly unforgettable.\nWhile the Steam Plant helped establish the steam turbine as capable of…\n\nHosted by Crowdsource Choir & Infinite Spaces Productions",
    "location": "Georgetown Steam Plant, 6605 13th Ave S, Seattle, WA 98108, USA",
    "url": "https://lu.ma/rjnmb93j"
  },
  {
    "start": "2024-08-29T23:00:00+00:00",
    "end": "2024-08-30T01:00:00+00:00",
    "id": "evt-fMOVLFjSf7IE7uZ@events.lu.ma",
    "summary": "Lecture 4: Scientific Strategy and Derisking",
    "description": "Get up-to-date information at: https://lu.ma/h6mnce47\n\nAddress:\nCheck event page for more details.\n\nNucleate Seattle is thrilled to announce we are hosting a panel on Scientific Strategy for biotech companies. Come learn how the scientific decisions of life science ventures are made from local industry experts.\nCome hear from Nick Reder (Aplenglow Biosciences), Elizabeth Ruzzo (Adyn), Charlie Roco (Parse Biosciences) and David Sparkman-Yager (Wayfinder Biosciences) to gain insights into product validation, understanding experimental prioritization, and making data-driven decisions to ensure your innovation can make it to market.\nThis event will provide practical advice on transitioning from…\n\nHosted by Nucleate Seattle",
    "location": "https://lu.ma/e/evt-fMOVLFjSf7IE7uZ",
    "url": "https://lu.ma/h6mnce47"
  },
  {
    "start": "2024-08-30T00:00:00+00:00",
    "end": "2024-08-30T02:00:00+00:00",
    "id": "evt-WeeZWrwmJbtyqBz@events.lu.ma",
    "summary": "The [bracket] Soirée | Seattle Edition",
    "description": "Get up-to-date information at: https://lu.ma/7p08lp5z\n\nAddress:\nCheck event page for more details.\n\nHello! 👋\n\nWe are excited to host the Seattle edition of the The [bracket] Soirée this August!\n\nWe are curating an evening of connections and conversations with some of the leading software executives and high growth startup founders in Seattle who are crafting the new-age playbooks of global GTM in incredible ways!\nAbout Bracket:\nBracket is an initiative by BoldCap, a B2B software & AI fund. We connect global GTM leaders to fast growing early stage Indian startups to explore meaningful collaborations which could shape into mentorship, advisory, becoming a fractional leader, angel investor…\n\nHosted by Aditi Gera, Samuel Sunderaraj & BoldCap",
    "location": "https://lu.ma/e/evt-WeeZWrwmJbtyqBz",
    "url": "https://lu.ma/7p08lp5z"
  },
  {
    "start": "2024-08-31T01:00:00+00:00",
    "end": "2024-08-31T03:00:00+00:00",
    "id": "evt-fSkfhyhpp3XxEEa@events.lu.ma",
    "summary": "Lynnwood Link Opening Celebration",
    "description": "Get up-to-date information at: https://lu.ma/acp542yo\n\nAddress:\nHemlock State Brewing Co.\n\nOn Friday, August 30 celebrations continue with the opening of Sound Transit's light rail extension to Lynnwood. Celebrate this new connection to Snohomish county with us in Mountlake Terrace, your light rail gateway into King County's northern neighbor. We'll be hosting a celebration social at Hemlock State Brewing starting at 6pm.\nAn all-ages venue, Hemlock State started out of a garage in Shoreline (near another light station opening at month's end) and is now within two blocks of the new Mountlake Terrace Station. Come after your first ride on Lynnwood Link.\nSound Transit is hosting their…\n\nHosted by The Urbanist",
    "location": "Hemlock State Brewing Co., 23601 56th Ave W Suite 400, Mountlake Terrace, WA 98043, USA",
    "url": "https://lu.ma/acp542yo"
  },
  {
    "start": "2024-09-05T23:00:00+00:00",
    "end": "2024-09-06T01:00:00+00:00",
    "id": "evt-01rnoeWPx6fozae@events.lu.ma",
    "summary": "Lecture 5: Fundraising Opportunities",
    "description": "Get up-to-date information at: https://lu.ma/kpxkptp7\n\nAddress:\nCheck event page for more details.\n\nNucleate Seattle is excited to announce we are hosting a panel on Fundraising Opportunities for new biotech companies. This panel will feature experts from local funding agencies. Come gain insight into the how/when a biotech company can and should apply for funding!\nCome hear from Joe Horsman (Madrona), Ti Zhao (PackVC), Eric Larsen (Alliance of Angels) and Loretta Little (Washington Research Foundation) about the different application requirements and expectations from Governmental Grants, Private Investors, and Venture Capital Investments.\nThis event will provide practical advice on…\n\nHosted by Nucleate Seattle",
    "location": "https://lu.ma/e/evt-01rnoeWPx6fozae",
    "url": "https://lu.ma/kpxkptp7"
  },
  {
    "start": "2024-09-12T19:00:00+00:00",
    "end": "2024-09-12T21:00:00+00:00",
    "id": "evt-x0ODuv9hOVN1Z0i@events.lu.ma",
    "summary": "Walky Talky with the Author: The Empathy Dilemma",
    "description": "Get up-to-date information at: https://lu.ma/jsg8d1ld\n\nAddress:\nThe Collective Seattle\n\nJoin us for a walk and talk as we explore the challenges of balancing empathy with performance in today’s workplace.\nHear insights from Maria Ross on empathetic leadership as we discuss how leaders can navigate diverse mindsets, maintain productivity, and foster mutual respect.\nAs we walk, we’ll share experiences, tips, and strategies for creating a compassionate yet high-performing work environment. This is a great opportunity to connect, reflect, and gain practical insights while enjoying some fresh air.\nLet’s go for a “Walky Talky” together. 👟\nWalk Leaders:\nMaria Ross | TEDxSpeaker |…\n\nHosted by Loop Walking Club & 3 others",
    "location": "The Collective Seattle, 400 Dexter Ave N ste 100, Seattle, WA 98109, USA",
    "url": "https://lu.ma/jsg8d1ld"
  },
  {
    "start": "2024-09-13T01:00:00+00:00",
    "end": "2024-09-13T03:00:00+00:00",
    "id": "evt-KUzIw5GmWryHABy@events.lu.ma",
    "summary": "Club Cascadia Book Club",
    "description": "Get up-to-date information at: https://lu.ma/4mnz72tv\n\nAddress:\nGreen Lake Park\n\nClub Cascadia's September book club!\nWhat we're reading:\nLady Tan's Circle of Women by Lisa See\nTrigger Warning–explicit medical descriptions and conditions, miscarriage, some violence.\n6-7: Discussion\n7-8: Picnic & Book Swap\nBook Swap Instructions:\nBring a book that holds a special place in your heart, but you're ready to gift to someone else.\nWrap the book in paper.\nOn the outside, write a hint or two about why this read captured your heart—just enough to tantalize without spoiling the plot!\nThe book swap works like White Elephant, so you'll get the chance to steal someone else's book…\n\nHosted by Olivia Coning",
    "location": "Green Lake Park, 7201 East Green Lake Dr N, Seattle, WA 98115, USA",
    "url": "https://lu.ma/4mnz72tv"
  },
  {
    "start": "2024-09-18T00:00:00+00:00",
    "end": "2024-09-18T03:00:00+00:00",
    "id": "evt-6FZ2jAJsV7tNUfP@events.lu.ma",
    "summary": "LGBTQ+ Founders and Funders Meetup",
    "description": "Get up-to-date information at: https://lu.ma/lgbtq-founders-funders-01\n\nAddress:\nVenture Mechanics Startup Launchpad\n\nThe LGBTQ+ Founders & Funders Group will be holding its inaugural meeting on September 17th, 2024. Join us for networking from 5pm-6pm. The event will run from 6pm-7:30pm, and will be followed by our usual afterparty. Light dinner and beverages will be served. Free parking.\nThe group's objectives are to accelerate the success of scalable startups that are led by LGBTQ+ founders in the Puget Sound region, through a combination of events and resources. The monthly meetings (held every 3rd Wednesday of the month) are of course an enormous networking opportunity for founders to meet other…\n\nHosted by Venture Mechanics Startup Launchpad",
    "location": "Venture Mechanics Startup Launchpad, 14110 NE 21st St, Bellevue, WA 98007, USA",
    "url": "https://lu.ma/lgbtq-founders-funders-01"
  },
  {
    "start": "2024-09-22T00:30:00+00:00",
    "end": "2024-09-22T05:00:00+00:00",
    "id": "evt-EgoMCqr6kM7ikbA@events.lu.ma",
    "summary": "SEA NET: 1st Edition",
    "description": "Get up-to-date information at: https://lu.ma/75kyx2f8\n\nAddress:\nCheck event page for more details.\n\nMeet and kickback with some of Washington's best (but not limited to) designers, developers, engineers and creatives. We've got some exciting announcements coming soon. We hope to see you there!\nHosted by intdev\nschedule\nTBA\nTBA\nTBA\n\nHosted by Andy Alimbuyuguen & 3 others",
    "location": "https://lu.ma/e/evt-EgoMCqr6kM7ikbA",
    "url": "https://lu.ma/75kyx2f8"
  }
]