[
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "✨How to find Real Estate Off-Market  Deals Are Within Your Area! ✨",
    "description": "Real Estate Investors,\ncould you use a hack for discovering hidden property gems? We're talking about 3% interest rate properties that are off-market, far from the intense competition on the standard MLS!\nPlus, we're stepping it up even further! Our cutting-edge real estate software will give you the mailing addresses of potential private lenders in your area .\nImagine the convenience of sharing your promising deals through a compelling letter, right to their mailbox!\nDiscover all this (and so much more) by joining our insightful workshop tomorrow, Monday, from 5 PM - 7 PM PST\nWe're excited to share our knowledge to help you grow your real estate portfolio smarter, leaving the crowd of buyers clutching at MLS listings behind.\nTo grab your seat, copy and past this link to register:\nhttps://myshorter.com/xqTTS\nYou will receive a text and email title ' Roxy', zoom link will send out 15 min before the meeting.\nPlease Email us if you have trouble to login or any questions\ncrestoneinvestments@gmail.com or text 360 209 8789\nWelcome join our Facebook group US REAL ESTATE INVESTING for more information and events.\nKen & Lesley\n\nTags: ",
    "location": "Online event",
    "url": "https://www.meetup.com/bellevue-real-estate-investing-meetup-group/events/302680501/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Starting and Building a Career in Software Engineering",
    "description": "**Register here to secure your spot**\nABOUT\nDemand for Software Engineers has doubled in the last year alone, making “Software Engineer” one of the most in-demand and top-paying jobs in tech. And according to the U.S. Bureau of Labor, the job market for Software Engineers is expected to grow an additional 22 percent by 2030.\nHow can you take advantage of these exciting career opportunities?\nJoin BrainStation for a multi-disciplinary panel discussion that will explore the fastest-rising jobs in tech, including the growth of software engineering, what skills are most important for success in the field, career paths, and more.\nSCHEDULE\n\n12:00 pm EST: Trends and career paths in software engineering\n12:10 pm EST: Multi-disciplinary career panel begins\n12:50 pm EST: Audience Q&A\n1:00 pm EST: Wrap up and next steps\n\nRegister here to secure your spot and stay tuned for speaker updates.\n\nTags: Events in Seattle, WA, Web Development, Bootcamps, Professional Development, Software Engineering, Learn to Code",
    "location": "Online event",
    "url": "https://www.meetup.com/brainstation-seattle-tech-skills-and-careers/events/303004781/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "AI for Software Engineers (Part 1): Deep Learning & Neural Networks",
    "description": "Join Codesmith CEO & Co-Founder, Will Sentance, for a high-level map of deep learning and neural networks where we will dive into the following:\n\nPrediction: Datasets, weights & forward propagation\nLearning: Gradient descent\nBackpropagation\n\nPrice: Always free!\nExperience Level: All experience levels welcome. We recommend getting started on our free JavaScript learning platform CSX and working on the Precourse unit before the workshop.\n\nTags: Events in San Francisco, CA, Web Development, JavaScript, Software Development, Software Engineering, Learn to Code",
    "location": "Online event",
    "url": "https://www.meetup.com/build-with-code-west-coast/events/302866988/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "How to Write the Best Resume for Software Engineering Jobs",
    "description": "Are you ready to embark on your journey toward a thriving career in software engineering? 🚀 Your resume is your passport to the tech world, and crafting an exceptional one is the first step to landing your dream job.\nJoin us for an engaging and informative webinar, \"How to Write Your Best Resume for Software Engineering Jobs,\" where we will equip you with the skills and insights you need to create a standout resume that impresses recruiters and hiring managers. 💼📝\nWho can attend?\nThe webinar is designed to be inclusive and beneficial to a wide audience interested in software engineering careers or seeking to improve their resume-writing skills specifically for software engineering roles. Experienced and aspiring software engineers, tech enthusiasts, career changers, job seekers, HR professionals, educators, and career advisors are welcome to join. 🙋‍♂️🙋‍♀️👩‍💻👨‍💻\nWhat to expect?\nOverall, participants can expect a highly informative, interactive, and engaging session that will help them enhance their resume-writing skills specifically for software engineering roles, whether they are newcomers to the field or experienced professionals looking to take the next step in their careers. 📚🖥️\nWhat You’ll Need:\n\nLaptop or a Desktop computer with a stable internet connection 💻🌐\nNote-Taking tools or your resume (Optional) 📝📄\n\nFAQs:\nQ: How long will the webinar last?\nA: The webinar lasts for 1 hour long. ⏰\nQ: Is there a fee to attend the webinar?\nA: No, this session is completely free. 💰❌\nQ: Is this webinar suitable for entry-level software engineers?\nA: Yes, this webinar is designed to benefit both entry-level and experienced software engineers, as well as those considering a career change to software engineering. 🎓👩‍💼👨‍💼\nSee you there! 👋👩‍💻👨‍💻\n\nTags: Events in Vancouver, BC, Career Network, Job Search, Resume, Cover Letters, Interview Help, Resume Writing, Job Interview Prep",
    "location": "Online event",
    "url": "https://www.meetup.com/canada-codecamp/events/302803384/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Getting Started Investing in Real Estate  - Zoom",
    "description": "Text SREI to (206) 596-7189 for registration and zoom link.\nGet Started Investing in Real Estate Now! If you are serious, NOW is the right time to do it.\nCome see us and learn how to get started!\nThis is an overview of Real Estate Investing, you will learn several different techniques of Investing, including flipping houses.\nDon't miss this chance to expand your horizon. This knowledge will get you started in Real Estate Investing and change your future possibilities.\nYou will have an opportunity to learn how to pay off your amortized debt faster without changing your lifestyle, by using our proprietary software you can do deals with your fingertips.\nJoin us and see for yourself!\n\nTags: Events in Seattle, WA",
    "location": "Online event",
    "url": "https://www.meetup.com/fix-flip-house-tour-meetup/events/302745580/"
  },
  {
    "start": "2024-08-28T13:30:00-07:00",
    "end": "2024-08-28T14:30:00-07:00",
    "id": "",
    "summary": "Business Referrals Meeting in Bellevue!",
    "description": "FREE 2 HOUR PARKING LOCATED ON NE 10TH STREET (ASHTON PARKING)\nPlease feel free to contact us if you have any questions on parking\nHi Everyone,\nWe are a group of local professionals that meet in Bellevue every week to pass business leads/referrals to help each other grow our businesses. We have one member for each business category and are growing quickly!\n1. Financial Advisor: Gabriel Armancas (Ameriprise Financial)\n2. Real Estate Broker: Aman Narayan (Compass)\n3. General Contractor: Tyler Dourte (Power Builders)\n4. P&C Insurance: Duy Bui (State Farm)\n5. Printer: Dan Kidd (Xerox)\n6. Massage Therapist: Nicolle Candland\n7. Acupuncturist: Andrew Zeng (Rise Acupuncture and Wellness Clinic)\n8. Business Broker: Racheal Scott\n9. Mortgage Broker: Huy Nguyễn\n10. Permanent Makeup & Paramedical Tattoo Artist: Jamie Morara\n11. Website Specialist: Karlo Tavares\n12. Chiropractor: AJ Henkins (Intercession Chiropractic)\n13. Business Security Systems: Benjamin Hoenig\n14. Dog Trainer: Trey Foster (Tune Up Pup)\n15. Banker: Lanna Garcia (Banner Bank)\n16. Landscape Architect: Tim Glass\n17. Window Coverings: Armi Avila (Amazing Blinds by Armi)\n18. Personal Trainer: Freneau Wang\nWe are still looking for any category not on this list! Notably:\n*) Photographer\n*) Website Developer\n*) Property Management\n*) Business Coach\n*) CPA\n*) Bookkeeper\n*) Travel Agent\n*) Custom Software Development\n*) Virtual Assistant\n*) Commercial Realtor\n*) Plumber/ Plumbing Company\n*) Nutritionist\n*) Recruiter\n*) Personal Trainer\n*) Jeweler\n*) Physical Therapist\n*) Moving Company\n*) Wedding Planner\n*) Title and Escrow\n*) Dentist\n*) Home Inspector\n*) Landscaper\n*) Virtual Assistant\n*) Florist\n*) Professional Cleaners\n*) Credit Card Processor\n*) Event Planner\n*) Small Business Owner looking to grow their business!\n*) Aesthetician\n*) Heating/ Air conditioning\n*) Flooring\n*) Painter\n*) Payroll Services\n*) Solar Energy\n*) Business/ House Cleaner\nCheers,\nPlease call/text Aman Narayan, our co-organizer for questions/directions!\nAman Narayan: 425-306-1777\nOur office is located in the Salesforce building in Downtown Bellevue. We will be using the business conference room on the 1st floor.\n\nTags: ",
    "location": "Online event",
    "url": "https://www.meetup.com/meetup-group-krnpoehv/events/301324735/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Decentralization: Evolution from ECDSA to Schnorr Signatures",
    "description": "This meetup dives into the exciting world of Schnorr signatures, a cryptographic advancement poised to revolutionize Bitcoin's security and efficiency. We'll compare it to the current signing method, ECDSA (Elliptic Curve Digital Signature Algorithm), and explore how Schnorr offers a significant upgrade.\nGet ready to unravel the mysteries of Schnorr signatures!\nThe Evolution: From ECDSA to Schnorr: We'll explore the technical differences between ECDSA and Schnorr signatures, highlighting how Schnorr builds upon the foundation laid by ECDSA.\nEnter Schnorr Signatures: Discover the exciting world of Schnorr signatures and how they offer compelling advantages over ECDSA:\nSlim Down Transactions: Schnorr signatures can significantly reduce transaction sizes, potentially leading to lower fees.\nBoost Privacy: Schnorr signatures offer enhanced privacy features, making transactions less traceable.\nSpeed Up Verification: Faster verification times can improve the overall efficiency of the Bitcoin network.\nJoin this interactive meetup for a fun and informative exploration of Schnorr signatures!\n\nTags: Blockchain, Bitcoin, Cryptocurrency, Ethereum, Web 3.0",
    "location": "Online event",
    "url": "https://www.meetup.com/openvswitch/events/301772350/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Career Workshop - Financial Advisor",
    "description": "Agenda:\nRole Requirements\nWhat we have to offer Agents\nOur Value Proposition\nBusiness Model\nCompensation Schedule\nNext Steps to Hiring\nFinancial Advisor Job Description\n\nFully-remote position, ideal for stay-at-home career seekers or those seeking additional income. F/T, P/T or Referral Partner options.\nNo prior experience required, comprehensive training provided.\nSeeking motivated, entrepreneurial and committed business partners to become licensed professionals and serve clients nationwide.\n\nExperience: No financial experience required; hands-on learning provided. Skills in leadership, public speaking, customer service, sales, banking, accounting/software, or entrepreneurship are beneficial.\nOpportunity Description:\n\nDevelop Financial Need Analysis (FNA) for Clients\nAssist families, individuals, and business owners with financial strategies, including asset protection, legacy building, index strategies, debt management, estate planning, life insurance, annuities, and final expenses.\n1099 position with performance-based business model.\n\nTags: Events in Portland, OR",
    "location": "Online event",
    "url": "https://www.meetup.com/portland-financial-professional-development-meetup-group/events/302739087/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "How to Recession-Proof Your Job Search",
    "description": "There are many groups promoting this event.\nOur meetup group is participating by promoting this event.\nThis event is organized by Albert's List.\nThis is an online event.\nAttendees can be located anywhere in the world!\nThis event is FREE to attend.\nIn order to attend, please register here:\nhttps://www.eventbrite.com/e/how-to-recession-proof-your-job-search-tickets-947208675647?aff=ideatoipo\nThe job market is losing steam, with recent news darker than ever.\n\nIntuit recently laid off 1,800 workers as it transitions to AI-based products. Dell laid off 12,500 and Intel another 15,000.\nPersistently high interest rates have discouraged employers from continuing to hire.\nCalifornia now has fewer technology jobs than it did pre-pandemic.\nThe US Labor Report shows very little private sector growth, with most jobs added in government and continues to revise previous reports downward.\nThe unemployment rate continues to creep upward, hitting 4.1% as of the end of June.\n\n\nEven though 2024 promised to be a better year, continued high inflation, a presidential election, and geopolitical uncertainty are contributing to a roller coaster job market. More candidates than ever are fighting for fewer roles, creating increased competition. The margin for error is very small.\nBe Recession-Proof\nAt Albert's List, we've spent the past 7 years examining the job search while serving a community of 50,000+ professionals across all career stages and types. In the process, we've developed frameworks that reveal the secrets of finding the next job while keeping the journey from becoming too overwhelming.\nJoin us for an upcoming free webinar that looks at both job search fundamentals and how to leverage tools, platforms, and the power of community to accelerate your job search.\nWe’ll walk through:\n\nA visual way to look at the job search, and how professionals of all levels can understand what they are expected to demonstrate during their hunt for work.\nHow to use AI tools to make your job search smarter and more efficient.\nWhy leveraging a community to keep you accountable can be the best way to foster success.\nHow to organize your job search to stay focused\nWhat's changed for job seekers in the current economy, and what's stayed the same from the Great Resignation era.\nAnd more!\n\nYou'll also learn about our upcoming Fall job search bootcamp where you'll get the skills, strategies, and accountability to succeed in your job search.\n\nTags: Events in San Francisco, CA",
    "location": "Online event",
    "url": "https://www.meetup.com/product-marketing/events/302732140/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "5 Secrets to Writing a Resume That Gets You Hired",
    "description": "There are many groups promoting this event.\nOur meetup group is participating by promoting this event.\nThis event is organized by Albert's List.\nThis is an online event.\nAttendees can be located anywhere in the world!\nThis event is FREE to attend.\nIn order to attend, please register here:\nhttps://www.eventbrite.com/e/5-secrets-to-writing-a-resume-that-gets-you-hired-tickets-953066305977?aff=ideatoipo\nIt's a competitive job market right now with a lot of talent on the market. Your resume is crucial—it’s the key to getting your foot in the door. Without a compelling document that highlights your successes, skills, and impact, you risk being overlooked. No longer can you submit an unformatted document and hope to get a call back.\nJoin us for an engaging webinar on mastering the art and science of resume writing. This session will empower you to create a resume that not only stands out but also positions you for your top job as you ready yourself for the Fall hiring season.\nHere's what you'll learn:\n\nUnderstanding the Resume's Purpose: Your resume is your first impression on potential employers. Learn how to leverage this document effectively to showcase your skills, experiences, and achievements in a way that captivates recruiters from the get-go.\nThe Secrets to Powerful Storytelling: In a sea of resumes, building trust sets you apart. Discover why quantifying your achievements and emphasizing results is crucial for grabbing attention and demonstrating your value to prospective employers.\nStrategic Resume Ordering: The order of information on your resume can make or break your chances of success. We'll guide you through the optimal structure, ensuring that your resume flows seamlessly and highlights your most impressive credentials.\nContent Do's and Don'ts: Navigate the fine line between informative and overwhelming. Understand what key information to include and what to leave out to ensure that your resume is concise, relevant, and compelling.\nHarnessing AI in Resume Writing: Artificial Intelligence has revolutionized the job market, but how can it enhance your resume-writing process? Explore where AI tools can be beneficial and when human touch is indispensable for crafting a personalized, impactful resume.\nHow to Optimize the Effectiveness of Your Resume: We’ll cover strategies on how to get past the bots and a measurement system to gauge its success.\n\nDon’t let a lackluster resume hinder your career aspirations. This webinar will equip you with the knowledge and tools to craft a standout resume that opens doors to numerous opportunities. Register now to take your first step towards career success!\nYou'll also learn about our 3-day resume workshop, where we'll walk you through each aspect of your resume and building success.\nAbout the Speaker:\nGretchen Hellman is a top Career Coach with deep experience blending the best of business with the latest in positive psychology to help her clients envision, get, grow, and evolve great careers. She has a deep and expansive understanding in all aspects of careers including planning, transition, job markets, hiring processes and practices, recruiter and hiring manager psychology, the art and science of resumes, career storytelling, job seeking, interviewing, negotiation, leadership, and performance. Her career coaching experience spans almost 10 years working with over one thousand professionals in almost every industry, profession, and career stage across the US and globally. Prior to becoming a Career Coach, she was a software Products and Marketing executive where she learned the secrets to market mastery that she applies to her current work in the job market.\nLearn more at www.outsidethebox.today\n\nTags: Events in San Francisco, CA",
    "location": "Online event",
    "url": "https://www.meetup.com/product-marketing/events/302972874/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "25% OFF! 3-Day Resume Workshop",
    "description": "There are many groups promoting this event.\nOur meetup group is participating by promoting this event.\nThis event is organized by Albert's List.\nThis is an online event.\nAttendees can be located anywhere in the world!\nThere is a cost to attend this event. Your RSVP here does not grant you admission.\nOur group is getting 25% off! Use code IDEATOIPO or visit:\nhttps://www.eventbrite.com/e/3-days-to-success-summer-resume-workshop-tickets-979041167487?aff=oddtdtcreator&discount=IDEATOIPO\nResumes are a critically important tool in the job search process. They are the key to getting your job search engine moving. If your resume is working for you, you'll get interviews and be asked the right questions during those interviews. If it's working against you, you might get asked the wrong questions, or worse, not get any interviews at all.\nJoin us for a 3-day workshop with Gretchen Hellman, expert-level career coach and master resume storyteller, to learn the secrets of writing a high-performing resume and ensuring it performs its best.\nIn three 90-minute sessions, you'll learn:\n\nHow hiring managers and recruiters read resumes and how to structure yours to tell the most powerful story possible.\nHow to connect your experience and expertise to the job market while eliminating worry about bots & ATS systems.\nThe secret to impactful bullet points that build trust and drive good questions in interviews, including easy hacks to quantify your impact.\nHow to ensure your resume has the right format, order, and everything else.\nWhen and how to use AI in your resume and when to leave it to humans.\n\nAgenda:\nDay 1 (August 27):\nGain a scientific understanding of how resumes tell your story. Learn how titles and companies form the superstructure of communication and how to overcome common challenges while remaining honest. Understand how to know if your resume is connecting to the job market. Take-home exercises will ensure you make real progress on improving your resume.\nDay 2 (August 28):\nParticipate in a live Q&A on resume storytelling to ensure you understand what you need to do. Learn how to write powerful bullet content with quantifiable results. Cover sections like Headline, Skills, and Education. Take-home exercises will help you master the Power Bullet Generator.\nDay 3 (August 29):\nThe workshop starts with a live Q&A, followed by how to translate your story into LinkedIn, effectively use your resume in the job market, and measure and continuously improve its performance.\nThis workshop is designed to equip you with the skills and knowledge to craft a standout resume that gets you job offers. Join us and take the next step in your career journey.\nAbout Gretchen Hellman\nGretchen Hellman is a top Career Coach with deep experience blending the best of business with the latest in positive psychology to help her clients envision, get, grow, and evolve great careers. She has a deep and expansive understanding in all aspects of careers including planning, transition, job markets, hiring processes and practices, recruiter and hiring manager psychology, the art and science of resumes, career storytelling, job seeking, interviewing, negotiation, leadership, and performance. Her career coaching experience spans almost 10 years working with over one thousand professionals in almost every industry, profession, and career stage across the US and globally.\nPrior to becoming a Career Coach, she was a software Products and Marketing executive where she learned the secrets to market mastery that she applies to her current work in the job market.\nLearn more at www.outsidethebox.today\n\nTags: Events in San Francisco, CA",
    "location": "Online event",
    "url": "https://www.meetup.com/product-marketing/events/302974894/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Beginners Real Estate Investing - Online",
    "description": "Text BREI to (206) 596-7189 for registration and zoom link.\nGet Started Investing in Real Estate Now! If you are serious, NOW is the right time to do it.\nCome see us and learn how to get started!\nThis is an overview of Real Estate Investing, you will learn several different techniques of Investing, including flipping houses.\nDon't miss this chance to expand your horizon. This knowledge will get you started in Real Estate Investing and change your future possibilities.\nYou will have an opportunity to learn how to pay off your amortized debt faster without changing your lifestyle, by using our proprietary software you can do deals with your fingertips.\nJoin us and see for yourself!\n\nTags: Events in Seattle, WA",
    "location": "Online event",
    "url": "https://www.meetup.com/real-estate-entrepreneurs-network/events/303012751/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "PNW CoffeeOps",
    "description": "We're a welcoming community from the Seattle-to-Portland PNW region!\nIn this event, we gather to talk about software tools and culture in downtown Portland. We meet Friday mornings on Zoom.\nOur Lean Coffee (http://leancoffee.org/) format allows us to talk about a diverse range of topics.\nWe follow the Seattle DevOps Code of Conduct https://seattledevops.net/codeofconduct/ and all attendees must read and abide by it.\nJoin us on slack! https://join.slack.com/t/coffeeops/shared_invite/zt-221exa8pf-fyFAM715Cf0KtFppbGuSBw (does not expire)\nAgenda:\n8:00 - 8:10 Mingle\n8:10 - 8:15 Get into groups (if one is going to be too large; generally cut off is about 10 people), then generate topics on Trello board\n8:15 - 8:20 Introductions and vote on topics\n8:20 - 9:10 Discussions\n9:10 - 9:15 Takeaways and wrap up\n9:15 - ?? Sometimes people hang out after for follow-up conversations that we did not have time for in the main group!\n\nTags: Events in Seattle, WA",
    "location": "Online event",
    "url": "https://www.meetup.com/seattle-coffeeops/events/302619524/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "How to Get Your First Job as a Software Engineer or Tester & Resume Reviews",
    "description": "How to Start a Career in IT for University Graduates, Bootcamp Alumni, and Newcomers to the US?\nLanding your first job in software engineering or testing in the US is one of the toughest stages in your career, especially in today’s competitive market. Most employers require U.S. work experience, and the competition can seem overwhelming.\nIn our webinar, we will share proven strategies to help you secure your first job. Our experts will also conduct resume reviews and provide valuable feedback. 🎯\nSpeakers:\n\nEugene Polonsky - Engineering Manager, IMDb (Amazon)\nGeorge Andraws - Director of Engineering, Hilton; ex-Apple, ex-Microsoft\n\nJoin Here: https://us06web.zoom.us/webinar/register/7617242979285/WN_KCgadfT7TtCdjK-LHhRj5g\nJoin our community in Slack: https://join.slack.com/t/agilemeetups-global/shared_invite/zt-1flbygozb-STF7foRW2WP07vtj1qfp_w\nDisclaimer:\nThis is an educational event and is not a job interview opportunity.\nThe presence of any panelists is neither a guarantee nor a promise of future employment.\nThe panelists in these videos do not represent their companies,\nand the opinions and views expressed through this event\ndo not reflect any company’s opinions or views.\nThe intent of the event is solely educational and to serve as a learning experience.\n\nTags: Events in Seattle, WA",
    "location": "Online event",
    "url": "https://www.meetup.com/seattleagile/events/302974581/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "EnterpriseGuy Investment Club Meeting",
    "description": "Join Here: https://www.enterpriseguy.com/events\nInvestment lectures occur every Sunday from 10AM - 12PM (unless it's a holiday or if I'm busy)\nPlease join this telegram channel for updates: https://t.me/EnterpriseTeam\nInvestment Tools I Use:\n• Finviz: https://finviz.com/?a=100613214\n• GuruFocus: https://goo.gl/TxAFJQ\n\nTags: ",
    "location": "Online event",
    "url": "https://www.meetup.com/softwareinvestor/events/302654378/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Trust & Verify: How Code Signing and Sigstore Secure the Software Supply Chain",
    "description": "Securi-Taco Tuesdays - Trust and Verify: How Code Signing and Sigstore Secure the Software Supply Chain\nAugust 27, 2024\n12:00pm PT | 1:00pm MT | 2:00pm CT | 3:00pm ET | 8:00pm BST | 9:00pm CET | 10:00pm EET\n--------------------------------------------\nJoin Adolfo García Veytia, Stacklok Staff Engineer based out of Mexico City, and Stacey Potter, Stacklok Open Source Community Manager based out of New York as they dive into all things Security + Tacos!\nToday's Topic: Trust and Verify: How Code Signing and Sigstore Secure the Software Supply Chain\nCode signing is crucial for ensuring the authenticity and integrity of software, but what exactly does it entail? In this livestream, we'll demystify code signing, exploring its significance in software security and how it helps prevent tampering and unauthorized modifications. From understanding digital signatures to the role of certificate authorities, we'll cover it all.\nOnce we’ve covered the basics of code signing, we’ll dive into Sigstore, the open source project created to make it easier for developers to securely sign and verify software artifacts. Sigstore leverages cryptographic principles and transparency logs to enhance trust and accountability. We'll discuss how Sigstore works, its benefits, and its potential to revolutionize software assurance practices.\nWhether you're a developer looking to bolster your understanding of code signing or a security enthusiast interested in emerging technologies like Sigstore, this livestream offers valuable insights and practical knowledge. Get ready to dive into the mechanisms that safeguard software integrity and explore the future of secure software development.\n--------------------------------------------\nGuest Speakers:\nHayden Blauzvern is a technical lead & manager on Google’s Open Source Security Team, focused on making open-source software more secure through code signing and applied transparency. Hayden is a maintainer and the community chair on the Sigstore project.\nBob Callaway leads Google's Open Source Security Team. He and his team directly contribute to critical OSS secure software supply chain projects (including Sigstore that he co-founded), as well as help drive adoption of best practices throughout the broader open source ecosystem.\n--------------------------------------------\nEvent Links:\n\nYouTube Livestream\nLinkedIn Livestream\n\n--------------------------------------------\nAbout our Hosts:\nAdolfo García Veytia (@puerco) is a staff software engineer with Stacklok He is one of the Kubernetes SIG Release Technical Leads, actively working on the Release Engineering team. He specializes in improving the software that drives the K8s release process. He is also the creator of the OpenVEX and protobom projects currently incubating in the OpenSSF. Adolfo is passionate about coding with friends, helping new contributors, and amplifying the Latinx presence in the Cloud Native community.\nStacey is an Open Source Community Manager at Stackok. Stacey has been in open source since 2009 and in the cloud native community since 2019 when she joined Weaveworks and worked as a Community Manager on various Open Source projects, including Flux. She currently participates in the GitOps Working Group / OpenGitOps communities. Stacey has organized and produced events such as the GitOpsDays conference and various meetups, and is a Program Co-Chair of Platform Engineering Day. When she’s not helping folx in the cloud native & open source communities, you can find her working on various home renovation projects, playing golf, or hanging at home with family or at trivia/karaoke nights at the local pub with friends.\n--------------------------------------------\nIf you're interested in speaking as a guest, please email us at TACOS@stacklok.com\n--------------------------------------------\n\nTags: Events in Seattle, WA, Open Source, Github, Software Development, Computer Security, Software Security",
    "location": "Online event",
    "url": "https://www.meetup.com/stacklok-user-group/events/302177682/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Future of Software Development - The Monthly Dev #44",
    "description": "The Monthly Dev brings world-class speakers to empower the developers' community, once a month. Made with ❤️ by daily.dev.\nAgenda:\nWe're excited to announce our next event in this series with an awesome lineup of speakers! See details below.\nOpening remarks by Francesco Ciulla (Developer Advocate at daily.dev)\nhttps://twitter.com/FrancescoCiull4\nTalk 1\nYoav Abrahami, Wix Enterprise CTO and head of Coding Products\nhttps://x.com/yoavabrahami\nTalk title: Where the future is heading for JS Frameworks…\nTalk 2\nDennis Ivy, Developer Advocate at Appwrite\nhttps://x.com/dennisivy11\nTalk title: Do we REALLY need SSR?\nAbstract: What is SSR and why do we need it? A deep dive into SSR vs CSR and how this changes the way we build modern web apps/\nTalk 3\nJonathan Harel, VP R&D and Cofounder @ Fine\nhttps://x.com/HaJongler\nTalk title: Software tomorrow\nAbstract: Join us for a journey through the present and future of software development. We'll share insights from producing the largest tech web series in Israel about how developers work today, covering everything from testing to teamwork. Then, we'll fast forward to the future. Find out why technical design is becoming more important, and discover how AI agents are changing the way we code. We'll show you how AI can make coding easier, giving engineers more time to solve important problems.\nStarting time: August 27th, 8AM PT (SF) / 11AM (NYC)\n\nTags: Events in San Francisco, CA, Web Development, Software Architecture, Computer Programming, JavaScript Frameworks, Software Development",
    "location": "Online event",
    "url": "https://www.meetup.com/the-monthly-dev-world-class-talks-by-expert-developers/events/302587638/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Silicon Valley Business Networking (Online)",
    "description": "Organizational Sponsor:\nStartup House\nNeed a place to stay short term in Silicon Valley?\nStay at Startup House in Palo Alto - the heart of Silicon Valley - for as low as $50 a night!\n-Network, socialize and connect with entrepreneurs all over the world!\n-Enjoy social events and startup and venture capital-related programming!\n- Have access to world class amenities, iconic tech companies, top tier venture capital firms, Stanford University, etc. - all within walking or biking distance!\nFor more info, send an email message to:\nsiliconvalleystartuphousing@gmail.com\nPut this in the subject header:\nSilicon Valley Startup Housing\nThis event is 100% online.\nParticipants can be located anywhere in the world!\nThis event is FREE to attend!\nIn order to attend, please register here:\nhttps://www.eventbrite.com/e/silicon-valley-business-networking-online-tickets-712802279807?aff=oddtdtcreator\n(The login link will be sent via email to Eventbrite registrants right before the start of the event.)\nHurry! Slots are limited!\nThere's no content or speaker at this event -- just business networking.\nBuild your business network - face to face (online)!\nJoin a virtual gathering of professionals from all walks of life from all over the world!\nYou may meet your next business collaborator, client, employer, employee or friend!\nMeet Silicon Valley movers and shakers and influencers from all over the world - tech entrepreneurs, developers, engineers, attorneys, bloggers, academics, thought leaders, community organizers, artists, financiers, and investors!\nN﻿etwork, socialize and connect!\nFor more info on Idea to IPO events, visit:\nwww.idea-to-ipo.com (our main meetup group among 160 meetup groups globally)\nhttps://www.youtube.com/@ideatoipo2 (videos of online events)\n@﻿ideatoipo\n\nTags: Events in Vancouver, BC",
    "location": "Online event",
    "url": "https://www.meetup.com/vancouver-idea-to-ipo/events/302675729/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Silicon Valley Business Networking (Online)",
    "description": "Organizational Sponsor:\nStartup House\nNeed a place to stay short term in Silicon Valley?\nStay at Startup House in Palo Alto - the heart of Silicon Valley - for as low as $50 a night!\n-Network, socialize and connect with entrepreneurs all over the world!\n-Enjoy social events and startup and venture capital-related programming!\n- Have access to world class amenities, iconic tech companies, top tier venture capital firms, Stanford University, etc. - all within walking or biking distance!\nFor more info, send an email message to:\nsiliconvalleystartuphousing@gmail.com\nPut this in the subject header:\nSilicon Valley Startup Housing\nThis event is 100% online.\nParticipants can be located anywhere in the world!\nThis event is FREE to attend!\nIn order to attend, please register here:\nSilicon Valley Business Networking (Online) Tickets, Multiple Dates | Eventbrite\n(The login link will be sent via email to Eventbrite registrants right before the start of the event.)\nHurry! Slots are limited!\nThere's no content or speaker at this event -- just business networking.\nBuild your business network - face to face (online)!\nJoin a virtual gathering of professionals from all walks of life from all over the world!\nYou may meet your next business collaborator, client, employer, employee or friend!\nMeet Silicon Valley movers and shakers and influencers from all over the world - tech entrepreneurs, developers, engineers, attorneys, bloggers, academics, thought leaders, community organizers, artists, financiers, and investors!\nN﻿etwork, socialize and connect!\nFor more info on Idea to IPO events, visit:\nwww.idea-to-ipo.com (our main meetup group among 160 meetup groups globally)\nhttps://www.youtube.com/@ideatoipo2 (videos of online events)\n@﻿ideatoipo\n\nTags: Events in Vancouver, BC",
    "location": "Online event",
    "url": "https://www.meetup.com/vancouver-idea-to-ipo/events/302719988/"
  },
  {
    "start": null,
    "end": null,
    "id": "",
    "summary": "Best Practices for Managing Website Assets",
    "description": "Do you manage your organization’s website assets? If so, join us for an informative webinar designed to help guide you through the essential steps of preparing web assets and avoiding pitfalls.\nTopic: Managing Website Assets\nDate: Wednesday, August 28th\nTime: 12:00 pm PST\nDuration: Approximately 30 minutes\nWhere: Microsoft Teams Webinar (click here for the link)\nWhat You’ll Learn:\n\nPhoto & Video Guidelines: Best practices for optimizing images and video\nText Preparation Tips: Guidelines for compelling and SEO-friendly website content\nData: How to prepare your data (e.g., product and location data)\n\nThis webinar will provide you with practical insights and actionable tips.\nRegister For Free To Reserve Your Spot Today!\nDon’t miss this opportunity and feel free to share this invitation with colleagues who might benefit from this session.\nLooking forward to seeing you there!\nBest Regards,\nDarrell Hadden, CEO\nGraphically Speaking\ndarrell@graphicallyspeaking.ca\ngraphicallyspeaking.ca\n\nTags: Events in Vancouver, BC, Web Development, Websites, Website Optimization, Conversion Optimization, Web Technology",
    "location": "Online event",
    "url": "https://www.meetup.com/vancro/events/302809552/"
  }
]